# WorkflowFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SystemsAnalysisOptions..::..WorkflowFile Property
SystemsAnalysisOptions Class See Also
---
The file name of the EnergyPlus workflow script.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public string WorkflowFile { get; set; }
```

Visual Basic
---
```text
Public Property WorkflowFile As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ WorkflowFile {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
When requesting a new system analysis, it is okay to have an empty workflowFile in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would supply the weather file with the default value "HVAC Systems Loads and Sizing.osw".
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The analysis requires a valid workflow file. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace